function Change(id, newFrase){
    document.getElementById(id).innerHTML = newFrase;
}

function ChangePushUps(){
    Change("1","Уровень 1: Отжимания от стены");
    Change("1.1","Начальный уровень: 1 подход по 10 повторений");
    Change("1.2","Продвинутый уровень: 2 подхода по 25 повторений");
    Change("1.3","Условие перехода: 3 подхода по 50 повторений");

    Change("2","Уровень 2: Наклонные отжимания");
    Change("2.1","Начальный уровень: 1 подход по 10 повторений");
    Change("2.2","Продвинутый уровень: 2 подхода по 20 повторений");
    Change("2.3","Условие перехода: 3 подхода по 40 повторений");

    Change("3","Уровень 3: Отжимания на коленях");
    Change("3.1","Начальный уровень: 1 подход по 10 повторений");
    Change("3.2","Продвинутый уровень: 2 подхода по 15 повторений");
    Change("3.3","Условие перехода: 3 подхода по 30 повторений");

    Change("4","Уровень 4: Половинные отжимания");
    Change("4.1","Начальный уровень: 1 подход по 8 повторений");
    Change("4.2","Продвинутый уровень: 2 подхода по 12 повторений");
    Change("4.3","Условие перехода: 2 подхода по 25 повторений");

    Change("5","Уровень 5: Полные отжимнания");
    Change("5.1","Начальный уровень: 1 подход по 5 повторений");
    Change("5.2","Продвинутый уровень: 2 подхода по 10 повторений");
    Change("5.3","Условие перехода: 2 подхода по 20 повторений");
    
    Change("6","Уровень 6: Плотные отжимнания");
    Change("6.1","Начальный уровень: 1 подход по 5 повторений");
    Change("6.2","Продвинутый уровень: 2 подхода по 10 повторений");
    Change("6.3","Условие перехода: 2 подхода по 20 повторений");

    Change("7","Уровень 7: Неравномерные отжимания");
    Change("7.1","Начальный уровень: 1 подход по 5 повторений (на каждую сторону)");
    Change("7.2","Продвинутый уровень: 2 подхода по 10 повторений (на каждую сторону)");
    Change("7.3","Условие перехода: 2 подхода по 20 повторений (на каждую сторону)");

    Change("8","Уровень 8: Половинные отжимания на одной руке");
    Change("8.1","Начальный уровень: 1 подход по 5 повторений (на каждую сторону)");
    Change("8.2","Продвинутый уровень: 2 подхода по 10 повторений (на каждую сторону)");
    Change("8.3","Условие перехода: 2 подхода по 20 повторений (на каждую сторону)");

    Change("9","Уровень 9: Рычажные отжимания");
    Change("9.1","Начальный уровень: 1 подход по 5 повторений (на каждую сторону)");
    Change("9.2","Продвинутый уровень: 2 подхода по 10 повторений (на каждую сторону)");
    Change("9.3","Условие перехода: 2 подхода по 20 повторений (на каждую сторону)");

    Change("10","Уровень мастера: Отжимания на одной руке");
    Change("10.1","Начальный уровень: 1 подход по 5 повторений (на каждую сторону)");
    Change("10.2","Продвинутый уровень: 2 подхода по 10 повторений (на каждую сторону)");
    Change("10.3","Условие перехода: 1 подхода по 100 повторений (на каждую сторону)");
}

function ChangeSquats(){
    Change("1","Уровень 1: Плечи на полу");
    Change("1.1","Начальный уровень: 1 подход по 10 повторений");
    Change("1.2","Продвинутый уровень: 2 подхода по 25 повторений");
    Change("1.3","Условие перехода: 3 подхода по 50 повторений");

    Change("2","Уровень 2: Приседание «складкой ножичек»");
    Change("2.1","Начальный уровень: 1 подход по 10 повторений");
    Change("2.2","Продвинутый уровень: 2 подхода по 20 повторений");
    Change("2.3","Условие перехода: 3 подхода по 40 повторений");

    Change("3","Уровень 3: Поддержанный присед");
    Change("3.1","Начальный уровень: 1 подход по 10 повторений");
    Change("3.2","Продвинутый уровень: 2 подхода по 15 повторений");
    Change("3.3","Условие перехода: 3 подхода по 30 повторений");

    Change("4","Уровень 4: Полуприсяд");
    Change("4.1","Начальный уровень: 1 подход по 8 повторений");
    Change("4.2","Продвинутый уровень: 2 подхода по 35 повторений");
    Change("4.3","Условие перехода: 2 подхода по 50 повторений");

    Change("5","Уровень 5: Полный присед");
    Change("5.1","Начальный уровень: 1 подход по 5 повторений");
    Change("5.2","Продвинутый уровень: 2 подхода по 10 повторений");
    Change("5.3","Условие перехода: 2 подхода по 20 повторений");
    
    Change("6","Уровень 6: Закрытые приседания");
    Change("6.1","Начальный уровень: 1 подход по 5 повторений");
    Change("6.2","Продвинутый уровень: 2 подхода по 10 повторений");
    Change("6.3","Условие перехода: 2 подхода по 20 повторений");

    Change("7","Уровень 7: Неравномерные приседания");
    Change("7.1","Начальный уровень: 1 подход по 5 повторений (на каждую сторону)");
    Change("7.2","Продвинутый уровень: 2 подхода по 10 повторений (на каждую сторону)");
    Change("7.3","Условие перехода: 2 подхода по 20 повторений (на каждую сторону)");

    Change("8","Уровень 8: Половинные приседания на одной ноге");
    Change("8.1","Начальный уровень: 1 подход по 5 повторений (на каждую сторону)");
    Change("8.2","Продвинутый уровень: 2 подхода по 10 повторений (на каждую сторону)");
    Change("8.3","Условие перехода: 2 подхода по 20 повторений (на каждую сторону)");

    Change("9","Уровень 9: Приседания на одной ноге с поддержкой");
    Change("9.1","Начальный уровень: 1 подход по 5 повторений (на каждую сторону)");
    Change("9.2","Продвинутый уровень: 2 подхода по 10 повторений (на каждую сторону)");
    Change("9.3","Условие перехода: 2 подхода по 20 повторений (на каждую сторону)");

    Change("10","Уровень мастера: Приседание на одной ноге");
    Change("10.1","Начальный уровень: 1 подход по 5 повторений (на каждую сторону)");
    Change("10.2","Продвинутый уровень: 2 подхода по 10 повторений (на каждую сторону)");
    Change("10.3","Условие перехода: 2 подхода по 50 повторений (на каждую сторону)");
}


function ChangePullUps(){
    Change("1","Уровень 1: Вертикальное подтягивание");
    Change("1.1","Начальный уровень: 1 подход по 10 повторений");
    Change("1.2","Продвинутый уровень: 2 подхода по 20 повторений");
    Change("1.3","Условие перехода: 3 подхода по 40 повторений");

    Change("2","Уровень 2: Горизонтальное подтягивание");
    Change("2.1","Начальный уровень: 1 подход по 10 повторений");
    Change("2.2","Продвинутый уровень: 2 подхода по 20 повторений");
    Change("2.3","Условие перехода: 3 подхода по 30 повторений");

    Change("3","Уровень 3: Подтягивание «перочиный нож»");
    Change("3.1","Начальный уровень: 1 подход по 10 повторений");
    Change("3.2","Продвинутый уровень: 2 подхода по 15 повторений");
    Change("3.3","Условие перехода: 3 подхода по 20 повторений");

    Change("4","Уровень 4: Полуподтягивания");
    Change("4.1","Начальный уровень: 1 подход по 8 повторений");
    Change("4.2","Продвинутый уровень: 2 подхода по 11 повторений");
    Change("4.3","Условие перехода: 2 подхода по 15 повторений");

    Change("5","Уровень 5: Полное подтягивание");
    Change("5.1","Начальный уровень: 1 подход по 5 повторений");
    Change("5.2","Продвинутый уровень: 2 подхода по 8 повторений");
    Change("5.3","Условие перехода: 2 подхода по 10 повторений");
    
    Change("6","Уровень 6: Подтягивания узким хватом");
    Change("6.1","Начальный уровень: 1 подход по 5 повторений");
    Change("6.2","Продвинутый уровень: 2 подхода по 8 повторений");
    Change("6.3","Условие перехода: 2 подхода по 10 повторений");

    Change("7","Уровень 7: Неравные подтягивания");
    Change("7.1","Начальный уровень: 1 подход из 5 повторений (на каждой руке)");
    Change("7.2","Продвинутый уровень: 2 подхода по 7 повторений (на каждой руке)");
    Change("7.3","Условие перехода: 2 подхода по 9 повторений (на каждой руке)");

    Change("8","Уровень 8: Половинные подтягивания на одной руке");
    Change("8.1","Начальный уровень: 1 подход из 4 повторений (на каждой руке)");
    Change("8.2","Продвинутый уровень: 2 подхода по 6 повторений (на каждой руке)");
    Change("8.3","Условие перехода: 2 подхода по 8 повторений (на каждой руке)");

    Change("9","Уровень 9: Ассистированные подтягивания на одной руке");
    Change("9.1","Начальный уровень: 1 подход из 3 повторений (на каждой руке)");
    Change("9.2","Продвинутый уровень: 2 подхода по 5 повторений (на каждой руке)");
    Change("9.3","Условие перехода: 2 подхода по 7 повторений (на каждой руке)");

    Change("10","Уровень мастера: Подтягивание на одной руке");
    Change("10.1","Начальный уровень: 1 подход из 1 повторения (на каждой руке)");
    Change("10.2","Продвинутый уровень: 2 подхода по 3 повторений (на каждой руке)");
    Change("10.3","Условие перехода: 2 подхода по 6 повторений (на каждой руке)");
}


function ChangePress(){
    Change("1","Уровень 1: Поднятие колен к животу");
    Change("1.1","Начальный уровень: 1 подход по 10 повторений");
    Change("1.2","Продвинутый уровень: 2 подхода по 25 повторений");
    Change("1.3","Условие перехода: 3 подхода по 40 повторений");

    Change("2","Уровень 2: Подъем коленей лёжа");
    Change("2.1","Начальный уровень: 1 подход по 10 повторений");
    Change("2.2","Продвинутый уровень: 2 подхода по 20 повторений");
    Change("2.3","Условие перехода: 3 подхода по 35 повторений");

    Change("3","Уровень 3: Подъем согнутых коленей лёжа");
    Change("3.1","Начальный уровень: 1 подход по 10 повторений");
    Change("3.2","Продвинутый уровень: 2 подхода по 15 повторений");
    Change("3.3","Условие перехода: 3 подхода по 30 повторений");

    Change("4","Уровень 4: Лягушачьи подъемы лёжа");
    Change("4.1","Начальный уровень: 1 подход по 8 повторений");
    Change("4.2","Продвинутый уровень: 2 подхода по 15 повторений");
    Change("4.3","Условие перехода: 3 подхода по 25 повторений");

    Change("5","Уровень 5: Ровные прямые подъемы ног");
    Change("5.1","Начальный уровень: 1 подход по 5 повторений");
    Change("5.2","Продвинутый уровень: 2 подхода по 10 повторений");
    Change("5.3","Условие перехода: 2 подхода по 20 повторений");
    
    Change("6","Уровень 6: Подъемы коленей из виса на перекладине");
    Change("6.1","Начальный уровень: 1 подход по 5 повторений");
    Change("6.2","Продвинутый уровень: 2 подхода по 10 повторений");
    Change("6.3","Условие перехода: 2 подхода по 15 повторений");

    Change("7","Уровень 7: Подъёмы согнутой ноги");
    Change("7.1","Начальный уровень: 1 подход по 5 повторений ");
    Change("7.2","Продвинутый уровень: 2 подхода по 10 повторений");
    Change("7.3","Условие перехода: 2 подхода по 15 повторений");

    Change("8","Уровень 8: Висячие подъёмы лягушкой");
    Change("8.1","Начальный уровень: 1 подход по 5 повторений");
    Change("8.2","Продвинутый уровень: 2 подхода по 10 повторений");
    Change("8.3","Условие перехода: 2 подхода по 15 повторений");

    Change("9","Уровень 9: Подъёмы частично прямой ноги");
    Change("9.1","Начальный уровень: 1 подход по 5 повторений");
    Change("9.2","Продвинутый уровень: 2 подхода по 10 повторений");
    Change("9.3","Условие перехода: 2 подхода по 15 повторений");

    Change("10","Уровень мастера: Подъемы прямых ног в висе");
    Change("10.1","Начальный уровень: 1 подход по 5 повторений");
    Change("10.2","Продвинутый уровень: 2 подхода по 10 повторений");
    Change("10.3","Условие перехода: 2 подхода по 30 повторений");
}


function ChangeBridge(){
    Change("1","Уровень 1: Короткие мосты");
    Change("1.1","Начальный уровень: 1 подход по 10 повторений");
    Change("1.2","Продвинутый уровень: 2 подхода по 25 повторений");
    Change("1.3","Условие перехода: 3 подхода по 50 повторений");

    Change("2","Уровень 2: Ровные мосты");
    Change("2.1","Начальный уровень: 1 подход по 10 повторений");
    Change("2.2","Продвинутый уровень: 2 подхода по 20 повторений");
    Change("2.3","Условие перехода: 3 подхода по 40 повторений");

    Change("3","Уровень 3: Мосты под углом");
    Change("3.1","Начальный уровень: 1 подход по 8 повторений");
    Change("3.2","Продвинутый уровень: 2 подхода по 15 повторений");
    Change("3.3","Условие перехода: 3 подхода по 30 повторений");

    Change("4","Уровень 4: Мосты на голове");
    Change("4.1","Начальный уровень: 1 подход по 8 повторений");
    Change("4.2","Продвинутый уровень: 2 подхода по 15 повторений");
    Change("4.3","Условие перехода: 2 подхода по 25 повторений");

    Change("5","Уровень 5: Половинные мосты");
    Change("5.1","Начальный уровень: 1 подход по 8 повторений");
    Change("5.2","Продвинутый уровень: 2 подхода по 15 повторений");
    Change("5.3","Условие перехода: 2 подхода по 20 повторений");
    
    Change("6","Уровень 6: Полные мосты");
    Change("6.1","Начальный уровень: 1 подход по 6 повторений");
    Change("6.2","Продвинутый уровень: 2 подхода по 10 повторений");
    Change("6.3","Условие перехода: 2 подхода по 15 повторений");

    Change("7","Уровень 7: Шагающие по стене мосты (вниз)");
    Change("7.1","Начальный уровень: 1 подход по 3 повторений ");
    Change("7.2","Продвинутый уровень: 2 подхода по 6 повторений");
    Change("7.3","Условие перехода: 2 подхода по 10 повторений");

    Change("8","Уровень 8: Шагающие по стене мосты (вверх)");
    Change("8.1","Начальный уровень: 1 подход по 2 повторений");
    Change("8.2","Продвинутый уровень: 2 подхода по 4 повторений");
    Change("8.3","Условие перехода: 2 подхода по 8 повторений");

    Change("9","Уровень 9: Закрытые мосты");
    Change("9.1","Начальный уровень: 1 подход по 1 повторения");
    Change("9.2","Продвинутый уровень: 2 подхода по 3 повторений");
    Change("9.3","Условие перехода: 2 подхода по 6 повторений");

    Change("10","Уровень мастера: Двухопорные мосты");
    Change("10.1","Начальный уровень: 1 подход по 1 повторения");
    Change("10.2","Продвинутый уровень: 2 подхода по 3 повторений");
    Change("10.3","Условие перехода: 2 подхода по 10-30 повторений");
}


function ChangeHeadStand(){
    Change("1","Уровень 1: Стойка на голове у стены");
    Change("1.1","Начальный уровень: 30 секунд");
    Change("1.2","Продвинутый уровень: 1 минкта");
    Change("1.3","Условие перехода: 2 минуты");

    Change("2","Уровень 2: Поза ворона");
    Change("2.1","Начальный уровень: 10 секунд");
    Change("2.2","Продвинутый уровень: 30 секунд");
    Change("2.3","Условие перехода: 1 минута");

    Change("3","Уровень 3: Стойка на руках у стены");
    Change("3.1","Начальный уровень: 30 секунд");
    Change("3.2","Продвинутый уровень: 1 минута");
    Change("3.3","Условие перехода: 2 минуты");

    Change("4","Уровень 4: Частичные отжимания в стойке на руках");
    Change("4.1","Начальный уровень: 1 подход по 5 повторений");
    Change("4.2","Продвинутый уровень: 2 подхода по 10 повторений");
    Change("4.3","Условие перехода: 2 подхода по 20 повторений");

    Change("5","Уровень 5: Отжимания в стойке на руках");
    Change("5.1","Начальный уровень: 1 подход по 5 повторений");
    Change("5.2","Продвинутый уровень: 2 подхода по 10 повторений");
    Change("5.3","Условие перехода: 2 подхода по 15 повторений");
    
    Change("6","Уровень 6: Закрытые отжимания в стойке на руках");
    Change("6.1","Начальный уровень: 1 подход по 5 повторений");
    Change("6.2","Продвинутый уровень: 2 подхода по 9 повторений");
    Change("6.3","Условие перехода: 2 подхода по 12 повторений");

    Change("7","Уровень 7: Неравноменые отжимания в стойке на руках");
    Change("7.1","Начальный уровень: 1 подход по 5 повторений (на каждую сторону)");
    Change("7.2","Продвинутый уровень: 2 подхода по 8 повторений (на каждую сторону)");
    Change("7.3","Условие перехода: 2 подхода по 10 повторений (на каждую сторону)");

    Change("8","Уровень 8: 1/2 отжимания в стойке на одной руке");
    Change("8.1","Начальный уровень: 1 подход из 4 повторений (на каждой руке)");
    Change("8.2","Продвинутый уровень: 2 подхода по 6 повторений (на каждой руке)");
    Change("8.3","Условие перехода: 2 подхода по 8 повторений (на каждой руке)");

    Change("9","Уровень 9: Рычажные отжимания в стойке на руках");
    Change("9.1","Начальный уровень: 1 подход из 3 повторений (на каждой руке)");
    Change("9.2","Продвинутый уровень: 2 подхода по 4 повторений (на каждой руке)");
    Change("9.3","Условие перехода: 2 подхода по 6 повторений (на каждой руке)");

    Change("10","Уровень мастера: Отжимание в стойке на одной руке");
    Change("10.1","Начальный уровень: 1 подход из 1 повторения (на каждой руке)");
    Change("10.2","Продвинутый уровень: 2 подхода по 2 повторений (на каждой руке)");
    Change("10.3","Условие перехода: 2 подхода по 5 повторений (на каждой руке)");
}